nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB2/KW47B42ZB2_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>BTU2_REG</name>
      <description>BTU</description>
      <alternatePeripheral>BLE2_REG</alternatePeripheral>
      <groupName>BTU2_REG</groupName>
      <baseAddress>0xA9020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFFFFFFF</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BTU_RIF_CTL0</name>
          <description>RIF Control 0</description>
          <addressOffset>0xC00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BRF_Rd_Data_Turnaround</name>
              <description>BRF Read Data Turnaround</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>BRF read data will be ready on the next clock cycle after address given</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>BRF needs one more clock cycle between address and read data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRF_AGC_Counter_Readback_Enable</name>
              <description>Enable BRF readback LNA, CBPF and ADC overflow counters after AGC freeze</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>BRF only readback RSSI and noise floor values at RSSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>BRF readback extra 3 bytes (LNA, CBPF and ADC overflow counters) after RSSI read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Radio_Type</name>
              <description>Radio Type</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V000</name>
                  <description>Unknown</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V001</name>
                  <description>Marvell Gen3 radio, dBus mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V010</name>
                  <description>Marvell Gen4 radio, dBus mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Radio_Mode</name>
              <description>Radio Mode Selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V00</name>
                  <description>Marvell Radio Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V01</name>
                  <description>KW Radio, Sideband RIF interface</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V10</name>
                  <description>Unused</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V11</name>
                  <description>Unused</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RX_SIGNAL_QUAL0</name>
          <description>RIF Rx SIGNAL QUALITY 0</description>
          <addressOffset>0xC02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1800</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>linkBdrRxSignalQualityEn</name>
              <description>RX signal quality enable on BDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rxSignalQualSampleDelay</name>
              <description>RX signal qual sample time</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RX_SIGNAL_QUAL1</name>
          <description>RIF Rx SIGNAL QUALITY 0</description>
          <addressOffset>0xC04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>linkEdrRxSignalQualityEn</name>
              <description>RX signal quality enable on EDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rxSignalQualCnt</name>
              <description>RX signal quality debug counter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_RSSI_ADDR</name>
          <description>RIF BRF RSSI Address</description>
          <addressOffset>0xC06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2E8</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RSSI_Addr</name>
              <description>RSSI Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_CTRL1</name>
          <description>RIF Control 1</description>
          <addressOffset>0xC0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Bd_SPI_Data_BiDir</name>
              <description>Uni- or Bi-directional dBus Data Line Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>uni-directional</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>bi-directional</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Bd_RxTx_Data_BiDir</name>
              <description>Uni- or Bi-directional RxData and TxData Line Selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>uni-directional</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>bi-directional</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSSI_Value</name>
              <description>RSSI Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RXON</name>
          <description>RIF RXON</description>
          <addressOffset>0xC0E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RxOn_Fixed</name>
              <description>RxOn fixed or use programmable timing</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>use start and stop timing parameters</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>rxOn = RxOn_Start[6]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxOn_Stop</name>
              <description>Delay from Rx finished (rifRx low) to rxOn falling edge</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_PLLCLKEN_ON_DELAY</name>
          <description>RIF PLL Clock Enable</description>
          <addressOffset>0xC10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x9</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BRF_PLL_Clk_En_On_Delay_qus</name>
              <description>Delay from wakeUp to turning of BRF's PLL clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRF_PLL_Clk_En_Nb</name>
              <description>Activate brf_pll_clk_en during NB/MB scan packets Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>keep off during NB/MB scan packets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>activate brf_pll_clk_en during NB/MB scan packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRF_PLL_Clk_En_Fixed</name>
              <description>Use fixed value for brf_pll_clk_en</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>on/off_delay registers control the timing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>brf_pll_clk_en is the fixed value of bit[0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_TXON</name>
          <description>RIF Tx On</description>
          <addressOffset>0xC12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3300</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TxOn_Fixed</name>
              <description>TxOn fixed, or use programmable timing</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>use start and stop timing parameters</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>txOn = TxOn_Start[6]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TxOn_Stop</name>
              <description>Delay from Tx finished (rifTx low) to txOn falling edge</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_PLLCLKEN_OFF_DELAY</name>
          <description>RIF PLL Clock Enable Off Delay</description>
          <addressOffset>0xC14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1D</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BRF_PLL_Clk_En_Off_Delay</name>
              <description>Delay from final dBus access finishing to turning off BRF PLL clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_FREQ</name>
          <description>RIF FREQ</description>
          <addressOffset>0xC16</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RxTx_Freq</name>
              <description>Rx or Tx Slot Indication</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>Tx slot</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>Rx slot</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Freq</name>
              <description>Channel Hop Frequency Number</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_TX_PU</name>
          <description>RIF BRF Power Up for TX</description>
          <addressOffset>0xC18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x227</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>brf_tx_pu_on_delay_qus</name>
              <description>brf_pu on delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_tx_pu_off_delay_qus</name>
              <description>brf_pu off delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_tx_pu_fixed</name>
              <description>Set brf_pu to a fixed value.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>use programmable timers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>fixed, brf_pu = brf_tx_pu_on_delay_us[0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_CTRL2</name>
          <description>RIF Control 2</description>
          <addressOffset>0xC1A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Tx_Data_Inv</name>
              <description>Invert Tx data</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>transmit data inverted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Rx_Data_Inv</name>
              <description>Invert Rx data</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>receive data inverted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_TX_PULSE</name>
          <description>RIF Tx Pulse</description>
          <addressOffset>0xC1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x80E6</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tx_Pulse_Delay</name>
              <description>Tx Pulse Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_Pulse_En</name>
              <description>Enable TxData sync pulse</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>TxData sync pulse deactivated and pulse not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>TxData sync pulse activated and pulse generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_DBUS_TX_PWRCTL</name>
          <description>RIF dBus Tx Power Control</description>
          <addressOffset>0xC1E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x801C</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Tx_Pwr_Ctrl_Wr_Delay</name>
              <description>Delay from the trigger to start Tx Power Control Write dBus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBus_Tx_Pwr_Ctrl_Wr_Enable</name>
              <description>Enable Automatic Tx Power Control Write on the dBus</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_DBUS_RX_PWRCTL</name>
          <description>RIF dBus Rx Power Control</description>
          <addressOffset>0xC20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x801A</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Rx_Pwr_Ctrl_Wr_Delay</name>
              <description>Delay from the trigger to start Rx Power Control Write dBus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBus_Rx_Pwr_Ctrl_Wr_Enable</name>
              <description>Enable Automatic Rx Power Control Write on dBus</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_RXPWRCTL_ADDR</name>
          <description>RIF BRF Rx Power Control Address</description>
          <addressOffset>0xC22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x9</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Pwr_Ctrl_Addr</name>
              <description>Radio Register Address for Rx Power Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
