nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB2/KW47B42ZB2_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>REGFILE0</name>
      <description>REGFILE</description>
      <groupName>REGFILE</groupName>
      <baseAddress>0xA91A1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>REG[%s]</name>
          <description>Register File Register index</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG</name>
              <description>Register File</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>REGFILE1</name>
      <description>REGFILE</description>
      <groupName>REGFILE</groupName>
      <baseAddress>0xA91A2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x108</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>REG[%s]</name>
          <description>Register File Register index</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG</name>
              <description>Register File</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAR</name>
          <description>Write Access Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WAR0</name>
              <description>REG0 Register Write Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to write to the REGn register and WARn field until next reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to write to the REGn register and WAR0 field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAR1</name>
              <description>REG1 Register Write Access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to write to the REGn register and WARn field until next reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to write to the REGn register and WAR1 field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAR2</name>
              <description>REG2 Register Write Access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to write to the REGn register and WARn field until next reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to write to the REGn register and WAR2 field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAR3</name>
              <description>REG3 Register Write Access</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to write to the REGn register and WARn field until next reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to write to the REGn register and WAR3 field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAR4</name>
              <description>REG4 Register Write Access</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to write to the REGn register and WARn field until next reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to write to the REGn register and WAR4 field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAR5</name>
              <description>REG5 Register Write Access</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to write to the REGn register and WARn field until next reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to write to the REGn register and WAR5 field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAR6</name>
              <description>REG6 Register Write Access</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to write to the REGn register and WARn field until next reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to write to the REGn register and WAR6 field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAR7</name>
              <description>REG7 Register Write Access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to write to the REGn register and WARn field until next reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to write to the REGn register and WAR7 field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RAR</name>
          <description>Read Access Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RAR0</name>
              <description>REG0 Register Read Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to read the REGn register until next reset. Reading corresponding REGn register returns all 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to read the REGn register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAR1</name>
              <description>REG1 Register Read Access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to read the REGn register until next reset. Reading corresponding REGn register returns all 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to read the REGn register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAR2</name>
              <description>REG2 Register Read Access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to read the REGn register until next reset. Reading corresponding REGn register returns all 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to read the REGn register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAR3</name>
              <description>REG3 Register Read Access</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to read the REGn register until next reset. Reading corresponding REGn register returns all 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to read the REGn register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAR4</name>
              <description>REG4 Register Read Access</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to read the REGn register until next reset. Reading corresponding REGn register returns all 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to read the REGn register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAR5</name>
              <description>REG5 Register Read Access</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to read the REGn register until next reset. Reading corresponding REGn register returns all 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to read the REGn register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAR6</name>
              <description>REG6 Register Read Access</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to read the REGn register until next reset. Reading corresponding REGn register returns all 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to read the REGn register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAR7</name>
              <description>REG7 Register Read Access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>Not allow to read the REGn register until next reset. Reading corresponding REGn register returns all 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>Allow to read the REGn register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
